app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "description", "priority", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 18 May 2012 20:55:40 UTC +00:00], ["description", "Dfgvdxb"], ["priority", 3], ["updated_at", Fri, 18 May 2012 20:55:40 UTC +00:00]]
---
  def create
		@task=Task.new(params[:task])
		if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
		@task=Task.find(params[:id]) #find busca el params

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
---
  def destroy
		Task.find(params[:id]).try(:delete)