app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Mon, 21 May 2012 17:18:58 UTC +00:00], ["email", "mana2009@unitec.edu"], ["updated_at", Mon, 21 May 2012 17:18:58 UTC +00:00], ["username", "Manuel Nunez"]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save